from resnet18.custom_dataset import CustomDataset

if __name__ == '__main__':
    DATASET_ROOT = r'G:\pill3'
    print(CustomDataset(DATASET_ROOT).class_to_idx)

    """
    {
        '기타-8자형': 0, 
        '기타-강낭콩형': 1, 
        '기타-구형': 2, 
        '기타-나뭇잎형': 3, 
        '기타-나비형': 4, 
        '기타-눈물형': 5, 
        '기타-도넛형': 6, 
        '기타-레몬형': 7, 
        '기타-방패형': 8, 
        '기타-볼록삼각형': 9, 
        '기타-사과형': 10, 
        '기타-십각형': 11, 
        '기타-치아형': 12, 
        '기타-클로버형': 13, 
        '기타-튜브형': 14, 
        '기타-하트형': 15, 
        '마름모형': 16, 
        '반원형': 17, 
        '사각형': 18, 
        '삼각형': 19, 
        '오각형': 20, 
        '원형': 21, 
        '육각형': 22, 
        '장방형': 23, 
        '타원형': 24, 
        '팔각형': 25
    }
    """